[linux:audit:ocsf]
# types here https://access.redhat.com/articles/4409591
# easy find fields to check off immediately
REPORT-message = nixmessages
FIELDALIAS-activity_name = type as activity_name
FIELDALIAS-event_code = type as metadata.event_code
FIELDALIAS-actoruser = auid as actor.user
FIELDALIAS-actorprocess = exe as actor.process
FIELDALIAS-actorses = ses as actor.session
EVAL-metadata.name = "auditd"
EVAL-metadata.log_provider = "auditd"
EVAL-metadata.log_version = "auditd"
EVAL-time=strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.logged_time=strftime(_indextime, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.original_time=strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.product = "auditd"
EVAL-metadata.version = "1.0.0"
EVAL-type_uid=(class_uid*100+activity_id)
LOOKUP-type_name = nix_account_change_type_name type_uid OUTPUT type_name type_uid_description

# Account Change [3001] Class
# covers the following audit types: ADD_GROUP, ADD_USER, DEL_USER, DEL_GROUP, CHGRP_ID, USER_CHAUTHTOK
# does not cover these fields yet count: duration, end_time, enrichments, http_request, metadata(some), observables, raw_data, start_time, status_code, timezone_offset, unmapped

EVAL-activity_id=case(type == "ADD_GROUP", "1", type == "ADD_USER", "1", type == "DEL_USER", "6", type == "CHGRP_ID", "7", type == "USER_CHAUTHTOK", "7")
EVAL-category_name=case(type == "ADD_GROUP", "Identity & Access Management", type == "ADD_USER", "Identity & Access Management", type == "DEL_USER", "Identity & Access Management", type == "CHGRP_ID", "Identity & Access Management", type == "USER_ACCT", "Identity & Access Management", type == "USER_CHAUTHTOK", "Identity & Access Management")
EVAL-category_uid=case(type == "ADD_GROUP", "3", type == "ADD_USER", "3", type == "DEL_USER", "3", type == "CHGRP_ID", "3", type == "USER_CHAUTHTOK", "3")
EVAL-class_name=case(type == "ADD_GROUP", "Account Change", type == "ADD_USER", "Account Change", type == "DEL_USER", "Account Change", type == "CHGRP_ID", "Account Change", type == "USER_ACCT", "Account Change", type == "USER_CHAUTHTOK", "Account Change")
EVAL-class_uid=case(type == "ADD_GROUP", "3001", type == "ADD_USER", "3001", type == "DEL_USER", "3001", type == "CHGRP_ID", "3001", type == "USER_CHAUTHTOK", "3001")
EVAL-src_endpoint=case(type == "ADD_GROUP", host, type == "ADD_USER", host, type == "DEL_USER", host, type == "CHGRP_ID", host, host, type == "USER_CHAUTHTOK", host)
EVAL-status=case(res=="failed", "failure", res=="success", "success", res=="yes", "success")
EVAL-user=case(type == "ADD_USER", id)
EVAL-severity=case(type == "ADD_GROUP", "2", type == "ADD_USER", "2", type == "DEL_USER", "2", type == "CHGRP_ID", "2", type == "USER_CHAUTHTOK", "2")
EVAL-user_result.uid_alt=case(type == "ADD_USER", replace(user, "[a-zA-Z\(\)]", ""))
EVAL-user_result.account=case(type == "ADD_USER", id)
EVAL-user_result.name=case(type == "ADD_USER", id)
EVAL-user_result.id=case(type == "ADD_USER", "0")
EVAL-user_result.uid=case(type == "ADD_USER", replace(user, "[a-zA-Z\(\)]", ""))
LOOKUP-severity = nix_account_change_severity_id severity_id OUTPUT severity
LOOKUP-status_id = nix_account_change_status_id status OUTPUT status_id

# Authentication [3002] Class
# does not cover these fields yet: activity_id: certificate, count, duration, enrichments, http_request, message, metadata, is_mfa, is_new_logon, observables, raw_data, status_detail, timezone_offset, unmapped

FIELDALIAS-logon_process = exe as logon_process
FIELDALIAS-logon_process.lineage = exe as logon_process.lineage
FIELDALIAS-logon_process.pid = pid as logon_process.pid
FIELDALIAS-logon_process.ses = ses as logon_process.session
FIELDALIAS-logon_process.user = ses as logon_process.auid
FIELDALIAS-servicename = exe as service.name
FIELDALIAS-session = ses as session.uid
EVAL-auth_protocol = case(isnull(auth_protocol), "pam")
EVAL-auth_protocol_id = case(isnull(auth_protocol_id), "99")
EVAL-category_name=case(type == "GRP_AUTH", "Identity & Access Management", type == "LOGIN", "Identity & Access Management", type == "CRYPTO_LOGIN", "Identity & Access Management", type == "USER_ACCT", "Identity & Access Management", type == "USER_LOGOUT", "Identity & Access Management", type == "USER_END", "Identity & Access Management", type == "USER_START", "Identity & Access Management")
EVAL-category_uid=case(type == "GRP_AUTH", "3", type == "LOGIN", "3", type == "CRYPTO_LOGIN", "3", type == "USER_ACCT", "3", type == "USER_LOGOUT", "3", type == "USER_END", "3", type == "USER_START", "3")
EVAL-class_name=case(type == "GRP_AUTH", "Authentication", type == "LOGIN", "Authentication", type == "CRYPTO_LOGIN", "Authentication", type == "USER_ACCT", "Authentication", type == "USER_LOGOUT", "Authentication", type == "USER_END", "Authentication", type == "USER_START", "Authentication")
EVAL-class_uid=case(type == "GRP_AUTH", "Authentication", type == "LOGIN", "3002", type == "CRYPTO_LOGIN", "3002", type == "USER_ACCT", "3002", type == "USER_LOGOUT", "3002", type == "USER_END", "3002", type == "USER_START", "3002")
EVAL-end_time=case(type == "USER_LOGOUT", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_END", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-is_cleartext=case(exe == "/usr/bin/sshd", "false", exe == "/usr/bin/sftp", "false", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-dst_endpoint=case(type == "GRP_AUTH", host, type == "LOGIN", host, type == "CRYPTO_LOGIN", host, type == "USER_ACCT", host, type == "USER_LOGOUT", host, type == "USER_END", host, type == "USER_START", host)
EVAL-logon_type=case(exe == "/usr/bin/sshd", "Remote Interactive", exe == "/usr/bin/sftp", "Remote Interactive", exe == "/usr/bin/ftp", "Network Cleartext", exe == "/usr/bin/telnet", "Network Cleartext")
EVAL-is_remote=case(exe == "/usr/bin/sshd", "true", exe == "/usr/bin/sftp", "true", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-session.created_time=case(exe == "/usr/bin/sshd", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/sftp", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/ftp", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/telnet", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-session.is_remote=case(exe == "/usr/bin/sshd", "true", exe == "/usr/bin/sftp", "true", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-severity=case(type == "GRP_AUTH", "Informational", type == "LOGIN", "Informational", type == "CRYPTO_LOGIN", "Informational", type == "USER_ACCT", "Informational", type == "USER_LOGOUT", "Informational", type == "USER_END", "Informational", type == "USER_START", "Informational")
EVAL-src_endpoint=case(type == "GRP_AUTH", addr, type == "LOGIN", addr, type == "CRYPTO_LOGIN", addr, type == "USER_ACCT", addr, type == "USER_LOGOUT", addr, type == "USER_END", addr, type == "USER_START", addr)
EVAL-start_time=case(type == "GRP_AUTH", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "LOGIN", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "CRYPTO_LOGIN", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_ACCT", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_START", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-user=case(type == "GRP_AUTH", auid, type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
EVAL-user.account=case(type == "GRP_AUTH", auid, type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
EVAL-user.name=case(type == "GRP_AUTH", auid, type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
LOOKUP-auth_proto_id = auth_protocol OUTPUT auth_protocol_id
LOOKUP-logontypeid = nix_authentication_logon_type_id_to_type logon_type OUTPUT logon_type_description logon_type_id
LOOKUP-severityid = nix_authentication_severity_id severity OUTPUT severity_id severity_description
