[linux:audit:ocsf]
# types here https://access.redhat.com/articles/4409591
# global fields to check off immediately
REPORT-auditdarguments = auditdarguments
REPORT-message = nixmessages
REPORT-auditdproctitle = auditdproctitle
# some of these fieldaliases cover too much, so will need to update with evals later, putting this here because alias covers entire sourcetype
#FIELDALIAS-activity_name = type as activity_name
FIELDALIAS-event_code = type as metadata.event_code
FIELDALIAS-actoruser = auid as actor.user
FIELDALIAS-actorprocess = exe as actor.process
FIELDALIAS-actorses = ses as actor.session
# starting combining of evals
EVAL-activity_id=case(syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT|O_NOCTTY%"), "1", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY"), "2", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY|O_CLOEXEC"), "2", syscall == "ftruncate", "3", syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT%"), "3", syscall == "unlinkat" AND nametype == "DELETE", "4", syscall == "openat" AND nametype == "NORMAL" AND arguments == "O_RDONLY|O_CLOEXEC" AND comm="mv", "5", syscall == "openat" AND nametype == "CREATE" AND comm="gpg", "10", syscall == "openat" AND nametype == "NORMAL" AND comm="mount", "12", syscall == "openat" AND nametype == "NORMAL" AND comm="umount", "13", like(type, "ANOM_%"), "1", type == "USER_AVC", "1", type == "AVC", "1", type == "ADD_GROUP", "1", type == "ADD_USER", "1", type == "DEL_USER", "6", type == "CHGRP_ID", "7", type == "USER_CHAUTHTOK", "7", type == "LOGIN", "1", type == "CRYPTO_LOGIN", "1", type == "USER_ACCT", "1", type == "USER_LOGOUT", "2", type == "USER_END", "2", type == "USER_START", "1", type == "KERN_MODULE" AND syscall == "init_module", "1" ,type == "KERN_MODULE" AND syscall == "delete_module", "2", type == "KERNEL_OTHER" AND syscall == "init_module", "1", type == "KERNEL_OTHER" AND syscall == "delete_module", "2", type == "SERVICE_START", "1" ,type == "SERVICE_STOP", "2")
EVAL-category_uid=case(syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT|O_NOCTTY%"), "1", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY"), "1", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY|O_CLOEXEC"), "1", syscall == "ftruncate", "1", syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT%"), "1", syscall == "unlinkat" AND nametype == "DELETE", "1", syscall == "openat" AND nametype == "NORMAL" AND arguments == "O_RDONLY|O_CLOEXEC" AND comm="mv", "1", syscall == "openat" AND nametype == "CREATE" AND comm="gpg", "1", syscall == "openat" AND nametype == "NORMAL" AND comm="mount", "1", syscall == "openat" AND nametype == "NORMAL" AND comm="umount", "1", like(type, "ANOM_%"), "2", type == "USER_AVC", "2", type == "AVC", "2", type == "ADD_GROUP", "3", type == "ADD_USER", "3", type == "DEL_USER", "3", type == "CHGRP_ID", "3", type == "USER_CHAUTHTOK", "3", type == "LOGIN", "3", type == "CRYPTO_LOGIN", "3", type == "USER_ACCT", "3", type == "USER_LOGOUT", "3", type == "USER_END", "3", type == "USER_START", "3", type == "USER_AUTH", "3", type == "GRP_AUTH", "3", type == "KERN_MODULE", "1", type == "KERNEL_OTHER", "1", type == "SERVICE_START", "1", type == "SERVICE_STOP", "1")
EVAL-class_uid=case(syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT|O_NOCTTY%"), "1001", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY"), "1001", syscall == "openat" AND nametype == "NORMAL" AND like(arguments, "O_RDONLY|O_CLOEXEC"), "1001", syscall == "ftruncate", "1001", syscall == "openat" AND nametype == "CREATE" AND like(arguments, "O_WRONLY|O_CREAT%"), "1001", syscall == "unlinkat" AND nametype == "DELETE", "1001", syscall == "openat" AND nametype == "NORMAL" AND arguments == "O_RDONLY|O_CLOEXEC" AND comm="mv", "1001", syscall == "openat" AND nametype == "CREATE" AND comm="gpg", "1001", syscall == "openat" AND nametype == "NORMAL" AND comm="mount", "1001", syscall == "openat" AND nametype == "NORMAL" AND comm="umount", "1001", like(type, "ANOM_%"), "2001", type == "USER_AVC", "2001", type == "AVC", "2001", type == "ADD_GROUP", "3001", type == "ADD_USER", "3001", type == "DEL_USER", "3001", type == "CHGRP_ID", "3001", type == "USER_CHAUTHTOK", "3001", type == "LOGIN", "3002", type == "CRYPTO_LOGIN", "3002", type == "USER_LOGOUT", "3002", type == "USER_END", "3002", type == "USER_START", "3002", type == "USER_ACCT", "3003", type == "KERN_MODULE", "1005", type == "KERNEL_OTHER", "1005", type == "SERVICE_START", "1007", type == "SERVICE_STOP", "1007")
#EVAL-category_name=case(type == "USER_AVC", "Findings", type == "AVC", "Findings", type == "ADD_GROUP", "Identity & Access Management", type == "ADD_USER", "Identity & Access Management", type == "DEL_USER", "Identity & Access Management", type == "CHGRP_ID", "Identity & Access Management", type == "USER_ACCT", "Identity & Access Management", type == "USER_CHAUTHTOK", "Identity & Access Management", type == "LOGIN", "Identity & Access Management", type == "CRYPTO_LOGIN", "Identity & Access Management", type == "USER_ACCT", "Identity & Access Management", type == "USER_LOGOUT", "Identity & Access Management", type == "USER_END", "Identity & Access Management", type == "USER_START", "Identity & Access Management", type == "USER_AUTH", "Identity & Access Management", type == "GRP_AUTH", "Identity & Access Management")
#EVAL-class_name=case(type == "USER_AVC", "Security Finding", type == "AVC", "Security Finding", type == "ADD_GROUP", "Account Change", type == "ADD_USER", "Account Change", type == "DEL_USER", "Account Change", type == "CHGRP_ID", "Account Change", type == "USER_ACCT", "Account Change", type == "USER_CHAUTHTOK", "Account Change", type == "LOGIN", "Authentication", type == "CRYPTO_LOGIN", "Authentication", type == "USER_ACCT", "Authentication", type == "USER_LOGOUT", "Authentication", type == "USER_END", "Authentication", type == "USER_START", "Authentication", type == "USER_AUTH", "Authorize Session", type == "GRP_AUTH", "Authorization Session")
EVAL-status_detail=case(type == "USER_AVC", message, type == "AVC", message, type == "USER_AUTH", message, type == "GRP_AUTH", message)
EVAL-severity_id=case(type == "ADD_GROUP", "2", type == "ADD_USER", "2", type == "DEL_USER", "2", type == "CHGRP_ID", "2", type == "USER_CHAUTHTOK", "2", type == "LOGIN", "Informational", type == "CRYPTO_LOGIN", "Informational", type == "USER_ACCT", "Informational", type == "USER_LOGOUT", "Informational", type == "USER_END", "Informational", type == "USER_START", "Informational", type == "USER_AUTH", "Informational", type == "GRP_AUTH", "Informational", type == "KERN_MODULE" AND syscall == "init_module", "1" ,type == "KERN_MODULE" AND syscall == "delete_module", "1", type == "KERNEL_OTHER" AND syscall == "init_module", "1", type == "KERNEL_OTHER" AND syscall == "delete_module", "1", type == "SERVICE_START", "1" ,type == "SERVICE_STOP", "1")
LOOKUP-nix_class_uid_activity_id_details = nix_class_uid_activity_id_details activity_id class_uid OUTPUT category_name category_uid class_name activity_name activity_description

#default settings shared between all events in OCSF
EVAL-metadata.name = "auditd"
EVAL-metadata.log_provider = "auditd"
EVAL-metadata.log_version = "auditd"
EVAL-time=strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.logged_time=strftime(_indextime, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.original_time=strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q")
EVAL-metadata.product = "auditd"
EVAL-metadata.version = "1.0.0"
EVAL-type_uid = (class_uid * 100 + activity_id)
#lookups
LOOKUP-type_name = nix_account_change_type_name type_uid OUTPUT type_name type_uid_description
LOOKUP-auth_proto_id = nix_authentication_id_to_protocol auth_protocol OUTPUT auth_protocol_id
LOOKUP-logontypeid = nix_authentication_logon_type_id_to_type logon_type OUTPUT logon_type_description logon_type_id
LOOKUP-severityid = nix_authentication_severity_id severity_id OUTPUT severity severity_description
LOOKUP-nix_security_risk_level = nix_security_risk_level risk_level_id OUTPUT risk_level
LOOKUP-severity = nix_account_change_severity_id severity_id OUTPUT severity
LOOKUP-status_id = nix_account_change_status_id status OUTPUT status_id
LOOKUP-analytic_type_id = nix_security_finding_analytic_type_id analytic.type_id OUTPUT analytic.type,analytic.type_description
LOOKUP-nix_security_impact = nix_security_impact impact_id OUTPUT impact impact_score


################
# Class specific fields and notes
################

# File System Activity [1001] Class
EVAL-component=case(class_uid == "1001", cwd + "/" + replace(full_proctitle, "(.+?)(\S+)\s$", "\2"))
# this one covers all 1000 level classes
EVAL-device=case(like(class_uid, "100%", host)
EVAL-file=case(class_uid == "1001", replace(full_proctitle, "(.+?)(\S+)\s$", "\2"))
EVAL-file_result.name=case(class_uid == "1001", file)
EVAL-file_result.owner=case(class_uid == "1001", ouid)
EVAL-file_result.signature=case(class_uid == "1001", inode)
EVAL-file_result.path=case(class_uid == "1001", cwd + "/" + replace(full_proctitle, "(.+?)(\S+)\s$", "\2"))
EVAL-file_result.type_id=case(mode == "file", "1", mode == "dir", "4", mode == "character", "1")
EVAL-sevirity_id=case(activity_id <= "5" AND class_uid == "1001", "1", class_uid == "1001" AND activity_id >= "6" AND activity_id >= "7", "1", class_uid == "1001" AND activity_id == "8", "1", class_uid == "1001" AND activity_id >= "9" AND activity_id <= "13", "3", class_uid == "1001" AND activity_id >= "14", "1")

# Module Activity [1005] Class
EVAL-module=case(type == "KERN_MODULE", name, type == "KERNEL_OTHER", name, type == "SERVICE_START", unit, type == "SERVICE_STOP", unit)

# Process Activity [1007] Class
# many go in other encompassing groups
EVAL-metadata.log_name=case(type == "SERVICE_START", "auditd", type == "SERVICE_STOP", "auditd")

# Security Finding [2001] Class

EVAL-analytic.category=case(type == "USER_AVC", "selinux", type == "AVC", "selinux", like(type, "ANOM_%"), "auditd_ids")
EVAL-analytic.desc=case(type == "USER_AVC", "User space AVC message", type == "AVC", "SELinux AVC denial or grant", type == "ANOM_ABEND1", "Triggered when a processes ends abnormally (with a signal that could cause a core dump, if enabled).", type == "ANOM_ACCESS_FS1", "Triggered when a file or a directory access ends abnormally.", type == "ANOM_ADD_ACCT1", "Triggered when a user-space account addition ends abnormally.", type == "ANOM_AMTU_FAIL1", "Triggered when a failure of the Abstract Machine Test Utility (AMTU) is detected.", type == "ANOM_CRYPTO_FAIL1", "Triggered when a failure in the cryptographic system is detected.", type == "ANOM_DEL_ACCT1", "Triggered when a user-space account deletion ends abnormally.", type == "ANOM_EXEC1", "Triggered when an execution of a file ends abnormally.", type == "ANOM_LINK1", "Triggered when suspicious use of file links is detected.", type == "ANOM_LOGIN_ACCT1", "Triggered when an account login attempt ends abnormally.", type == "ANOM_LOGIN_FAILURES1", "Triggered when the limit of failed login attempts is reached.", type == "ANOM_LOGIN_LOCATION1", "Triggered when a login attempt is made from a forbidden location.", type == "ANOM_LOGIN_SESSIONS1", "Triggered when a login attempt reaches the maximum amount of concurrent sessions.", type == "ANOM_LOGIN_TIME1", "Triggered when a login attempt is made at a time when it is prevented by for example pam_time.", type == "ANOM_MAX_DAC1", "Triggered when the maximum amount of Discretionary Access Control (DAC) failures is reached.", type == "ANOM_MAX_MAC1", "Triggered when the maximum amount of Mandatory Access Control (MAC) failures is reached.", type == "ANOM_MK_EXEC1", "Triggered when a file is made executable.", type == "ANOM_MOD_ACCT1", "Triggered when a user-space account modification ends abnormally.", type == "ANOM_PROMISCUOUS1", "Triggered when a device enables or disables promiscuous mode.", type == "ANOM_RBAC_FAIL1", "Triggered when a Role-Based Access Control (RBAC) self-test failure is detected.", type == "ANOM_RBAC_INTEGRITY_FAIL1", "Triggered when a Role-Based Access Control (RBAC) file integrity test failure is detected.", type == "ANOM_ROOT_TRANS1", "Triggered when a user becomes root.")
EVAL-analytic.name=case(type == "USER_AVC", "avc", type == "AVC", "avc", like(type, "ANOM_%"), "anom")
EVAL-analytic.type_id=case(type == "USER_AVC", "1", type == "AVC", "1", like(type, "ANOM_%"), "2")
# need to work on attacks array
EVAL-cis_csc.control=case(type == "USER_AVC", "Ensure SELinux policy is configured - config", type == "AVC", "Ensure SELinux policy is configured - config")
EVAL-cis_csc.version=case(type == "USER_AVC", "1.6.1.3", type == "AVC", "1.6.1.3")
# need to add compliance and subcategories
EVAL-confidence_id=case(type == "USER_AVC", "1", type == "AVC", "1", like(type, "ANOM_%"), "2")
LOOKUP-nix_security_confidence_id_translate = nix_security_confidence_id_translate confidence_id OUTPUT confidence confidence_description
EVAL-data_sources=case(type == "USER_AVC", "selinux", type == "AVC", "selinux", like(type, "ANOM_%"), "auditd_ids")
EVAL-evidence=case(type == "USER_AVC", message, type == "AVC", message)
EVAL-finding.title = case(type == "USER_AVC", msgtype, type == "AVC", msgtype, like(type, "ANOM_%"), type)
EVAL-finding.uid = case(type == "USER_AVC", pid, type == "AVC", pid, like(type, "ANOM_%"), pid)
EVAL-impact_id = case(type == "USER_AVC", "1", type == "AVC", "1", like(type, "ANOM_%"), "2")
# need kill_chain
# need malware
# need nist
# need observables
EVAL-process=case(type == "USER_AVC", exe, type == "AVC", exe, like(type, "ANOM_%"), exe, type == "SERVICE_START", exe ,type == "SERVICE_STOP", exe)
EVAL-resources.labels=case(type == "USER_AVC", subj, type == "AVC", subj, like(type, "ANOM_%"), subj)
EVAL-resources.owner = case(type == "USER_AVC", tclass, type == "AVC", tclass, like(type, "ANOM_%"), auid)
EVAL-risk_level_id= case(type == "USER_AVC", "1", type == "AVC", "1", like(type, "ANOM_%"), "2")
EVAL-severity_id= case(type == "USER_AVC", "2", type == "AVC", "2", like(type, "ANOM_%"), "2")
EVAL-state_id= case(type == "USER_AVC", "1", type == "AVC", "1", like(type, "ANOM_%"), "1")


# Account Change [3001] Class
# covers the following audit types: ADD_GROUP, ADD_USER, DEL_USER, DEL_GROUP, CHGRP_ID, USER_CHAUTHTOK
# does not cover these fields yet count: duration, end_time, enrichments, http_request, metadata(some), observables, raw_data, start_time, status_code, timezone_offset, unmapped

EVAL-src_endpoint=case(type == "ADD_GROUP", host, type == "ADD_USER", host, type == "DEL_USER", host, type == "CHGRP_ID", host, host, type == "USER_CHAUTHTOK", host)
EVAL-status=case(res=="failed", "failure", res=="success", "success", res=="yes", "success", success == "yes", "success", success == "no", "failure")
EVAL-user=case(type == "ADD_USER", id)
EVAL-user_result.uid_alt=case(type == "ADD_USER", replace(user, "[a-zA-Z\(\)]", ""))
EVAL-user_result.account=case(type == "ADD_USER", id)
EVAL-user_result.name=case(type == "ADD_USER", id)
EVAL-user_result.id=case(type == "ADD_USER", "0")
EVAL-user_result.uid=case(type == "ADD_USER", replace(user, "[a-zA-Z\(\)]", ""))

# Authentication [3002] Class
# does not cover these fields yet: activity_id: certificate, count, duration, enrichments, http_request, message, metadata, is_mfa, is_new_logon, observables, raw_data, status_detail, timezone_offset, unmapped

EVAL-auth_protocol=case(type == "LOGIN", "pam", type == "CRYPTO_LOGIN", "pam", type == "USER_ACCT", "pam", type == "USER_LOGOUT", "pam", type == "USER_END", "pam", type == "USER_START", "pam")
EVAL-auth_protocol_id=case(type == "LOGIN", "99", type == "CRYPTO_LOGIN", "99", type == "USER_ACCT", "99", type == "USER_LOGOUT", "99", type == "USER_END", "99", type == "USER_START", "99")
EVAL-logon_process=case(type == "LOGIN", exe, type == "CRYPTO_LOGIN", exe, type == "USER_ACCT", exe, type == "USER_LOGOUT", exe, type == "USER_END", exe, type == "USER_START", exe)
EVAL-logon_process.lineage=case(type == "LOGIN", exe, type == "CRYPTO_LOGIN", exe, type == "USER_ACCT", exe, type == "USER_LOGOUT", exe, type == "USER_END", exe, type == "USER_START", exe)
EVAL-logon_process.pid=case(type == "LOGIN", pid, type == "CRYPTO_LOGIN", pid, type == "USER_ACCT", pid, type == "USER_LOGOUT", pid, type == "USER_END", pid, type == "USER_START", pid)
EVAL-logon_process.session=case(type == "LOGIN", ses, type == "CRYPTO_LOGIN", ses, type == "USER_ACCT", ses, type == "USER_LOGOUT", ses, type == "USER_END", ses, type == "USER_START", ses)
EVAL-logon_process.user=case(type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
EVAL-service.name=case(type == "LOGIN", exe, type == "CRYPTO_LOGIN", exe, type == "USER_ACCT", exe, type == "USER_LOGOUT", exe, type == "USER_END", exe, type == "USER_START", exe)
EVAL-session.uid=case(type == "LOGIN", ses, type == "CRYPTO_LOGIN", ses, type == "USER_ACCT", ses, type == "USER_LOGOUT", ses, type == "USER_END", ses, type == "USER_START", ses)EVAL-end_time=case(type == "USER_LOGOUT", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_END", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-is_cleartext=case(exe == "/usr/bin/sshd", "false", exe == "/usr/bin/sudo", "false", exe == "/usr/bin/sftp", "false", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-dst_endpoint=case(type == "LOGIN", host, type == "CRYPTO_LOGIN", host, type == "USER_ACCT", host, type == "USER_LOGOUT", host, type == "USER_END", host, type == "USER_START", host)
EVAL-logon_type=case(exe == "/usr/bin/sshd", "Remote Interactive", exe == "/usr/bin/sftp", "Remote Interactive", exe == "/usr/bin/ftp", "Network Cleartext", exe == "/usr/bin/telnet", "Network Cleartext", exe == "/usr/bin/sudo", "Interactive")
EVAL-is_remote=case(exe == "/usr/bin/sshd", "true", exe == "/usr/bin/sudo", "false", exe == "/usr/bin/sftp", "true", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-session.created_time=case(exe == "/usr/bin/sshd", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/sudo", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/sftp", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/ftp", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), exe == "/usr/bin/telnet", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-session.is_remote=case(exe == "/usr/bin/sshd", "true", exe == "/usr/bin/sudo", "false", exe == "/usr/bin/sftp", "true", exe == "/usr/bin/ftp", "true", exe == "/usr/bin/telnet", "true")
EVAL-src_endpoint=case(type == "LOGIN", addr, type == "CRYPTO_LOGIN", addr, type == "USER_ACCT", addr, type == "USER_LOGOUT", addr, type == "USER_END", addr, type == "USER_START", addr)
EVAL-start_time=case(type == "LOGIN", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "CRYPTO_LOGIN", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_ACCT", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "USER_START", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-user=case(type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
EVAL-user.account=case(type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)
EVAL-user.name=case(type == "LOGIN", auid, type == "CRYPTO_LOGIN", auid, type == "USER_ACCT", auid, type == "USER_LOGOUT", auid, type == "USER_END", auid, type == "USER_START", auid)

#Authorize Session [3003] Class

EVAL-dst_endpoint=case(type == "USER_AUTH", host, type == "GRP_AUTH", host)
# missing group, can come from ES Identities
# missing privileges, can come from ES Identities
EVAL-src_endpoint=case(type == "USER_AUTH", addr, type == "GRP_AUTH", addr)
EVAL-start_time=case(type == "USER_AUTH", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"), type == "GRP_AUTH", strftime(_time, "%Y-%m-%dT%H:%M:%S.%Q"))
EVAL-user.account=case(type == "USER_AUTH", acct)
EVAL-user.name=case(type == "USER_AUTH", acct, type == "GRP_AUTH", acct)
EVAL-user.account=case(type == "USER_AUTH", acct, type == "GRP_AUTH", acct) 
EVAL-user.account=case(type == "USER_AUTH", acct, type == "GRP_AUTH", acct)
# missing user.type_id, can come from ES Identities
